[
  {
    "path": "posts/2021-07-25-vast-challenge-mc2/",
    "title": "Vast Challenge MC2",
    "description": "This blog is for the Vast Challenge 2021, Mini Challenge 2.",
    "author": [
      {
        "name": "Linli Zhong",
        "url": "https://github.com/LinliZhong"
      }
    ],
    "date": "2021-07-23",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview1.1 Background\r\n1.2 Literature review\r\n\r\n2. Data Preparation2.1 Install and load packages\r\n2.2 Import relevant data\r\n2.3 Data preparation\r\n\r\n\r\n1. Overview\r\n1.1 Background\r\nGAStech is a natural gas production company in an island country of Kronos in the past twenty years. It builds strong relationships with the government of Kronos but low environment stewardship. In January 2014, when celebrating the success fortune by IPO (initial public offering), several employees of GAStech went missing.\r\nThis post is focused on VAST Challenge 2021 Mini-Challenge 2. Mini-Challenge 2 provides useful data of missing employees’ relevant information, a list of vehicle assignments by employee, vehicle tracking data, loyalty card transaction data, credit and debit card transaction data, and a tourist map of Abila. In this post, I will make use of R language to visual and analyze available data and identify the suspicious activity of the employees.\r\n1.2 Literature review\r\nThe task of Mini Challenge 2 in 2014 was to find unusual patterns in employees’ daily lives from their credit/debit/loyalty card records and the GPS tracking records of their cars. In this article, I mainly refer to two works by Central South University and KU Leuven.\r\nFor Central South University, they used D3, MySQL, Excel as their visualization tools. They first identified daily routines for GAStech employees. They divided these missing employees into general staffs and truck drivers. Then they discuessed these two groups separately. They detected suspicious activities by visualization the credit card and gps data.\r\nFor KU Leuven, they had three stages to visualize. (1) Aggregate & Slice, (2) Design, Filter & Analyze and (3) Communicate. They first made full use of R to test their hypothesis. Then involved the design and implementation of streamlined tools to optimize the identification of specific patterns. After that, they presented and visualized the results.\r\n2. Data Preparation\r\n2.1 Install and load packages\r\nThe code chunk below is to check required packages are installed or not, if they are not installed, the code chunk will help install them automatically. After all packages are installed, the code chunk will load them.\r\n\r\n\r\npackages = c('igraph','ggraph','visNetwork','lubridate','dplyr',\r\n             'clock','tidyverse','DataExplorer','gplots','plotly',\r\n             'ggplot2','superheat','tm','plotly','lattice','GDAdata','raster',\r\n             'sf','tmap','foreign','gifski','rgdal','tiff','sp','leaflet',\"DT\"\r\n             )\r\nfor(p in packages){\r\n  if(!require(p, character.only = T)){\r\n  install.packages(p)\r\n  }\r\n  library(p,character.only = T)}\r\n\r\n\r\n\r\n2.2 Import relevant data\r\nThe data is stored in MC2 file. Read_csv()is to import four csv files into R. “Windows-1252” is a single-byte character encoding of the Latin alphabet for value “Katerina’s Café”.\r\n\r\n\r\ncc<- read_csv(\"MC2/cc_data.csv\",locale = locale(encoding = \"windows-1252\"))\r\nlyt<-read_csv(\"MC2/loyalty_data.csv\",locale = locale(encoding = \"windows-1252\"))\r\ngps <-read_csv(\"MC2/gps.csv\")\r\ncar<-read_csv(\"MC2/car-assignments.csv\")\r\n\r\n\r\n\r\n2.3 Data preparation\r\n1. Change data type. The code chunk below is to convert id in gps from number to factor, last4ccnum in cc from number to character and timestamp in gps, loyalty, and credit card from character data type to Datetime format.\r\n\r\n\r\ngps$id<-as.factor(gps$id)\r\ncar$CarID<-as.factor(car$CarID)\r\ncc$last4ccnum<-as.character(cc$last4ccnum)\r\ngps$Timestamp<-date_time_parse(gps$Timestamp,zone = \"\",format = \"%m/%d/%Y %H:%M:%S\")\r\nlyt$timestamp<-date_time_parse(lyt$timestamp,zone = \"\",format = \"%m/%d/%Y\")\r\ncc$timestamp<-date_time_parse(cc$timestamp,zone = \"\",format = \"%m/%d/%Y %H:%M\")\r\n\r\n\r\n\r\n2. Combine data. The code chunk below is to combine first name and last name of employee together in the list of car.\r\n\r\n\r\ncar$Name<-paste(car$FirstName,car$LastName)\r\n\r\n\r\n\r\n3. Add additional column. When analyzing the car assignment csv file, we may notice that the GAStech does not assign specific company truck for each truck driver, but this is not a case for other employees with title which is not truck driver. Hence, we can divide missing employees into two types, one is general employees, another one is truck driver, to further investigate their suspicious activities. Besides, add additional column for car type, and there are two types of cars, one for company truck another one for company car.\r\n\r\n\r\ncar$Category<-ifelse(car$CurrentEmploymentTitle == \"Truck Driver\", \r\n                       \"Truck Driver\",\"General Staff\")\r\ngps$car_type<-ifelse(gps$id %in% c('101','104','105','106','107'),'Company truck',\r\n                     'company car')\r\n\r\n\r\n\r\nThe code chunk below is to extract day of the timestamp and add it in column called “day” in each file.\r\n\r\n\r\ncc$day<-get_day(cc$timestamp)\r\nlyt$day<-get_day(lyt$timestamp)\r\ngps$day<-get_day(gps$Timestamp)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-25T20:13:37+08:00",
    "input_file": "vast-challenge-mc2.knit.md"
  },
  {
    "path": "posts/2021-06-18-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "This is the DataViz Makeover 2 for ISSS608.",
    "author": [
      {
        "name": "Linli Zhong",
        "url": "https://github.com/LinliZhong"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 Introduction\r\n2 Critique and Suggestions2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3 Proposed Visualization3.1 Sketch\r\n3.2 Advantages\r\n\r\n4 Proposed Visualization\r\n5 Step-by-Step Guide5.1 Data Preparation\r\n5.2 Bubble Plot\r\n5.3 Bars & Line\r\n5.4 Butterfly Chart\r\n5.5 Dashboard\r\n\r\n6 Derived Insights\r\n\r\n1 Introduction\r\nThe original data visualization is from Department of Statistics, Singapore. The data used in this graph is available in Merchandise Trade by Region/Market.\r\nThis visualization graph shows us ten merchandise trading partners of Singapore in 2020. We can find China has the largest total trading values while Thailand has the lowest total trading values from this graph. Meanwhile, we know Taiwan is the top net importers while Hong Kong is the top net exporters. However, this bubble chart is not good enough. In this makeover, I will criticize this graph and make an alternative graph to tell the story.\r\n\r\n\r\n\r\n2 Critique and Suggestions\r\n2.1 Clarity\r\n1. The center point (white circle) of the bubble is hard to judge which section it belongs to. For example, readers can hardly distinguish Mainland China, EU, and Republic of Korea is “net exporter” or “net importer” with naked eyes. It is better to build another chart to visual the section of the market.\r\n2. Notes in the blue box is irrelevant with the visualization. The title of this graph is about data in 2020, but the notes in blue box discuss the trade partners’ changes since 2009 and 2006. The notes in this box should be deleted because we cannot capture any trend over year for Mainland China and United States in this graph.\r\n3. There is no data source for reference. Data source at the bottom of the graph is needed to make sure the visualization is reliable and readers can check data as they wish. Data source part should be added to make the whole visualization completed.\r\n4. The bubble chart tries to show too much content. For instance, this graph tries to show the value of export, import, and total value. Besides, it wants readers can visual the partner is a net importer or net exporter, and at the same time it wants to highlight the top net importer and net importer. I would like to suggest adding one more chart to help this bubble chart show stories.\r\n5. No rank number in the annotation or tooltip. Readers need to count the rank by reading all the value for each partners. This is not user-friendly. So adding the rank number in annotation or tooltip is necessary.\r\n2.2 Aesthetic\r\n1. One color use for two categories. For visualization, we should use different colors for different categories. However, purple is repeatedly used for Thailand and EU. This ambiguity should be solved by using different contrast colors for different partners.\r\n2. The color is opaque and the size of the bubble is no need to be so big. Because of the inappropriate size, some partners are even overlapping together formed as clusters. Besides, the opaque bubbles make Readers hardly find the borders without clicking one specific circle. Adjusting opacity and size is necessary to separate different partners visually.\r\n3. Annotations for “Top Net Exporter” and “Top Net Importer” are not obvious. Some readers even do not notice this annotation in the graph because this graph is already colorful. Alternatively, adding the rank for “Net Importer” and “Net Exporter” in the annotation of each bubble can solve this problem.\r\n4. The tooltip in the bubble chart is randomly placed. The location of the tooltip didn’t follow the general rule of thumb. We in all four directions (left, right, ups, downs) of the bubbles are placed the tooltips. Readers cannot find the tooltip with the same color as bubble briefly. We need to place the tooltip at a pleasing position, for example put it in the center of the bubbles.\r\n3 Proposed Visualization\r\n3.1 Sketch\r\nThe proposed design is shown below.\r\n\r\n\r\n\r\n3.2 Advantages\r\n1. The visualization is divided into three parts; each graph tries to show a single story. For example, bubble graph tries to show the total value (export + import) for different partners; Line & charts tries to show the trend for all or one single partner over years; Butterfly charts tries to show difference (|export – import|) and to judge the partner is a net importer or net exporter.\r\n2. The opacity of color is well adjusted. To improve the quality of visualization, the color is carefully picked to avoid repeated colors in bubble chart. Apart from that, I try to keep the same tone for the same dimension in different graphs.\r\n3. Make the graph interactive and animative.To allow more meaningful insights, tableau dashboard interactive actions will be added in the visualization. Readers can click one part of the graph and get highlight or filter in other graphs. Meanwhile, animation function will also be added in the graph.\r\n4. Useful tooltip will be added for each graph. In each graph, I will create some calculation field to calculate the difference, absolute difference, rank and so on. Besides, in the butterfly chart, I will use the created calculation to judge the partner is a net importer or net exporter. The result will be added in the tooltip.\r\n4 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public, click here.\r\n\r\n\r\n\r\n5 Step-by-Step Guide\r\n5.1 Data Preparation\r\nOpen the data file in excel, filter out ten countries and regions in the given graph.\r\n\r\n\r\n\r\nCreate a new excel file named [Export_Import], paste the data into the worksheets of “Export” and “Import” separately.\r\n\r\n\r\n\r\nDelete the data which is not between Jan 2011 and Dec 2020.\r\n\r\n\r\n\r\nTo keep the unit number as the same, insert a new row under European Union(Million Dollars) and name it as “EU(Thousand Dollars)”. Set the formula “=B2*1000”. Drag the formula till December 2020. Copy and paste the “EU(Thousand Dollars) only in numbers. Repeat the above operation in Import sheet. Save the file.\r\n\r\n\r\n\r\nOpen Tableau, drag Export sheet into the panel. Select all the columns except variables, then click “Pivot”. For Variables, right click then click “Split”. Rename the column name (Split -> Market, Pivot Filed Name -> Date, Pivot Field Value -> Export Value(Thousand Dollars)). Then change the data type (Date: String -> Date, Export Value: String -> Number (whole)). Hide column of Variables.\r\n\r\n\r\n\r\nCreate a new Calculated Field named “Export Value”. The formula is “[Export Value(Thousand Dollars)]*1000”. Click ok and hide the column “Export Value (Thousand Dollars)”.\r\n\r\n\r\n\r\nDrag Import sheet into panel, repeat process 5 and 6.\r\n\r\n\r\n\r\nDouble click the line between table “Export” and “import”. Add join relationship Date = Date2.\r\n\r\n\r\n\r\n5.2 Bubble Plot\r\nDrag Import Value and Export Value into Rows and Columns respectively.\r\n\r\n\r\n\r\nCreate a calculated value called Total Value. It equals Export Value + Import Value.\r\n\r\n\r\n\r\nDrag [Market] into Color, Total value into Size. Then change the type from Automatic into Circle. Then adjust the size and Opacity of the bubble plot.\r\n\r\n\r\n\r\nDrag Total value into Label. Edit the format of label “Total Value”. Customized it as currency with units (B). Besides, set the format of [Export value] and [Import Value] with Billions.\r\n\r\n\r\n\r\nDrag [Date] into filter and choose it as year. Then right click it and select “Show Filter”. Set the filter as multiple values in dropdown list.\r\n\r\n\r\n\r\nCreate a new calculation variable called [Total Value Rank]. Then drag it into tooltip with computing use [country].\r\n\r\n\r\n\r\nEdit the layout and color of tooltip, and add title name for this graph.\r\n\r\n\r\n\r\n5.3 Bars & Line\r\nDrag [Date] into columns, [Import Values] into Rows. Then drag [Export Values] in the left hand side of the graph to make [Import Values] and [Export Values] use the same axis.\r\n\r\n\r\n\r\nDrag [Total Value] into rows, then right click it and choose “Dual Axis”.\r\n\r\n\r\n\r\nIn the right-hand side of the y axis, right click the axis and choose “Synchronize Axis” to make both sides of the y axis have the same tick marks.\r\n\r\n\r\n\r\nChange the graph type of “Measure Values” into Bars and turn off the Stack Marks.\r\n\r\n\r\n\r\nDrag [Measure Names] into Size and adjust the Measure Names Color.\r\n\r\n\r\n\r\nIn the upper side of the graph, right click the date and choose “hide field labels for columns” to make the graph looks better.\r\n\r\n\r\n\r\nRight click the right-hand side of the y axis, uncheck “Show Header”.\r\n\r\n\r\n\r\nDrag [Country] into filter and show filter.\r\n\r\n\r\n\r\nSet the title of the graph.\r\n\r\n\r\n\r\n5.4 Butterfly Chart\r\nCreate calculated field: zero.\r\n\r\n\r\n\r\nDrag [Export Value], [Zero], [Import Value] into columns, [Market] into rows.\r\n\r\n\r\n\r\nSelect [Zero] in columns and choose “Dual Axis” to merge [Export Value] and [Zero] into one graph.\r\n\r\n\r\n\r\nChange [Export Value] from automatic into bars and edit the axis to make the scale reversed.\r\n\r\n\r\n\r\nCreate a new calculated field called [Difference] to calculate the difference between export and import.\r\n\r\n\r\n\r\nCreate a new calculated field called [Abs] to get the absolute value of the difference.\r\n\r\n\r\n\r\nChange the graph type of [Zero] from automatic to text, then drag [Abs] into text. Right click zero axis and choose synchronize axis.\r\n\r\n\r\n\r\nEdit axis of [Zero], change the range from automatic into fixed. Adjust the fixed start to 0, fixed end into automatic.\r\n\r\n\r\n\r\nEdit the format of [Abs]. Set the number as Billions (B) with two decimals.\r\n\r\n\r\n\r\nEdit color of [zero] into black and make it bold.\r\n\r\n\r\n\r\nFor [Import Value], repeat the process from 7 to 10.\r\n\r\n\r\n\r\nCreate a new calculated field called [Net Exporter/Net Importer]. As the [Difference] is [Export Value] – [Import Value], the market will be a net exporter if the difference is greater than 0, else it will be a net importer.\r\n\r\n\r\n\r\nDrag [Net Exporter/Net Importer] into color and adjust the color settings.\r\n\r\n\r\n\r\nDrag [Export Value] and [Import Value] into Label separately and adjust the Label settings.\r\n\r\n\r\n\r\nDrag [Date] into filter and show filter.\r\n\r\n\r\n\r\nCreate a new calculated filed called [Exporter/Importer Rank] to calculate the rank of each market separately based on the category (Net Exporter/Net Importer).\r\n\r\n\r\n\r\nDrag [Exporter/Importer Rank] into tooltip. Set the font and color for the tooltip.\r\n\r\n\r\n\r\n5.5 Dashboard\r\nCreate a new dashboard. Set the size as automatic. Drag three graphs created above into the dashboard. And set the title of the dashboard.\r\n\r\n\r\n\r\nAdd actions “Market Highlight” for this dashboard. Uncheck the “Bars&Lines” and set highlight conditions as “Market”. And make run this action on hover.\r\n\r\n\r\n\r\nAdd Action “Filter by Region” to filter the region in the whole dashboard. When clicking on one market in Bubble plot or Butterfly chart, it will automatically filter the trend of this market.\r\n\r\n\r\n\r\nAdd action “Filter by year” to filter the year in the dashboard. When click one single year in “Bars&Lines”, other two charts will be filtered by this year automatically.\r\n\r\n\r\n\r\nAdd notes and source at the bottom of the dashboard.\r\n\r\n\r\n\r\n6 Derived Insights\r\nTrend: the merchandize trends for all these ten countries kept steady except a slightly decrease from 2014 to 2016 and a steady increase from 2017 to 2018. In each year, these ten partners exported more than they imported from Singapore.\r\n\r\n\r\n\r\nNet Exporter/ Net Importer: Hong Kong, Indonesia, Mainland China, and Thailand are net exporters, while EU, Japan, and Taiwan are net importers from 2011 to 2020. For United States and Republic of Korea, they became net exporters since 2020 and 2017 onwards respectively. For Malaysia, it became a net importer since 2019. Hong Kong has always been the top net exporter from 2011 to 2020. As for the top net importer, it was occupied by US (2011-2017) and Taiwan (2018-2020).\r\n\r\n\r\n\r\nTotal merchandize trade value: Mainland China’s total merchandize trade value ranked first since 2013 onwards. Before 2013, the first place belongs to Malaysia. Besides, the gap between Mainland China and Malaysia was getting bigger when Mainland China catches up with Malaysia.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-25T19:29:20+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This is the Makeover for ISSS608 Visual Analytics.",
    "author": [
      {
        "name": "Linli Zhong",
        "url": "https://github.com/LinliZhong"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique and suggestions1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2.0 Proposed Visualization2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Guide4.1 Preparation\r\n4.2 Visualization for area charts\r\n4.3 Visualization for horizontal bars\r\n4.4 Dashboard\r\n\r\n5.0 Derived Insights\r\n6.0 Reference\r\n\r\n1.0 Critique and suggestions\r\n The above picture shows the original data visualization.\r\n1.1 Clarity\r\n1. The scales of dual axis charts are arbitrary and may mislead the readers about the relationship between two data series. All the six charts have two y axis, one stands for Export another one stands for Import. However, they have different range not only between Export and Import, but also between different charts. Take Hongkong and Mainland China as an example, on the one hand, the Export of Hong Kong end with 6M while the Mainland China end with 8M. On the other hand, the Import part is more obvious to view this problem in these two regions. The unit of Hongkong is “k” (Thousand) dollars while the unit of Mainland China is “M” (Million) dollars. We can use combined axis instead of dual axis.\r\n2. The tick mark of Japan axis is not consistent with other graphs. Because the graph of Japan was zoomed out in the dashboard, it only shows 2020 in the graph. Actually, the data series of Japan in this graph is accurate, as it shows the same time range with other graphs (from 2019 to 2021, this is also a problem, I will mention this later). However, the graph of Japan will give readers an illusion that this graph only contains the data of 2020 and they may think “is the other data lost?” To address this problem, we can zoom in the graph of Japan in the dashboard.\r\n3. The title of the graph is problematic. If we open the origin dataset and order the data, we may find the top six trading regions are not these six places. This will be misleading to the readers as they may treat these six regions as the top trading regions from 2019 to 2020. Hence, the title should delete the word “Top”.\r\n4.The data range of these six graphs are from 2019 to 2021 not from 2019 to 2020. The title specifies the range of the data series from 2019 to 2020, but when I try to draw the same picture, I found these six graphs wrongly included the data from 2019 to 2021. This can also help us to explain why we can find 2021 in the tick marks of x axis. To keep pace with the title, we need to re-filter the range of year to 2019-2020.\r\n5. The name of the x axis is not precise. The name of x axis should not be “Month of Period” as the tick mark for x axis is year. Instead, we can rename it as “Year” or change the tick marks’ interval as months.\r\n6. Lack of data source part. At the bottom of the whole dashboard, there is no data source for readers to check. This part should be added to make the whole visualization completed.\r\n1.2 Aesthetics\r\n1. The location of the title for each graph is not appropriate. The title of each graph in the dashboard is far left. The layout of the title is not beautiful because it exceeds the main graph. It is better to make the title centered or with a certain amount of space before typing the region name.\r\n2. The location of the title for dashboard is not aesthetically pleasing. The title of the dashboard is adjusted as “Center”. However, it is not pleasing because it looks like the title is slightly to the right as the whole picture and it does not keep the balance of the whole dashboard. For this reason, we can put the location of the title as “Left”.\r\n3. The size of each graph in the dashboard are not the same. The graph of Mainland China and Malaysia look much bigger than other graphs and the graph of Japan seems like the smallest one. The graphs with different size in the dashboard are problematic and readers may perceive the subtle difference easily.\r\n4. The dual-scaled axis chart is difficult to directly recognize the data and intuitively make right judgements about the graphs. Although the two data series (Export and Import) with the same measures (million dollars), they have different magnitudes.\r\n5. The borders of the graph are not obvious. In all these six graphs, the Export and Import are overlapped with different colors. However, without the borders added, it cannot view clearly. So, we can add borders by clicking color in the Tableau. In the effects of the color tab, we can choose the border color.\r\n2.0 Proposed Visualization\r\n The proposed design is shown above.\r\n2.1 Clarity\r\n1. The whole dashboard is clear and completed. First of all, the title of the proposed visualization is “Merchandize Trade of Six Trading Regions, 2019-2020”. Secondly, at the bottom of the dashboard is the source part. This makes the whole dashboard completed.\r\n2. Combined axis is clearer to read. Instead of using dual axis chart, I decide to merge export and import into a single axis. In this way, readers can distinguish the tick marks more easily.\r\n3. Unify the y axis’s tick marks of six graphs. It is not difficult to distinguish that the tick marks of y axis in each graph are the same. It enables readers to compare the export or import values from different regions directly.\r\n4. The contents and the title of the dashboard keep consistent. Unlike the original dashboard, the contents contain the data from 2019 to 2021 while the title only contains 2019 and 2020, I filter out the data of 2021 and only remain data of 2019 and 2020 then keep the title as the same of what I filter here.\r\n5. Add horizontal bar charts in the dashboard. The charts show two year of total values for export and import respectively. Each horizontal bar chart aims to compare the total values in 2019 and 2020 of different regions. Readers can find the top k export/import regions from these two graphs.\r\n2.2 Aesthetics\r\n1. Still use area charts to visual the export and import. Using area charts, we can get an approximate idea of the difference between export and import for the period by visually subtracting the smaller area in the graph.\r\n2. The title for each sheet and title for dashboard are well placed. This looks much beautiful than the original ones.\r\n3. Each sheet is well organized and presented in the dashboard. I try to make all the sheets in the dashboard as the same size and make them display all the contents. There are no contents hided by accident.\r\n4. The bar charts are ordered by descending order. This makes readers view the rank of the region easily.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualisation on Tableau Public here\r\n4.0 Step-by-step Guide\r\n4.1 Preparation\r\nWhen we open the original excel file, we may find there are some unnecessary columns and rows. Firstly, we need to create a new spreadsheet, then copy and paste the contents we need into two sheet and rename these two sheets as “Import” and “Export”. \r\nHowever, for column A, all the region names are along with units “Million Dollars”. In order to remove the unit for each region name, we need to insert a new column before column B (1976 Jan). Then we use a formula “=LEFT(A2,FIND(”(“,A2)-1)” to help us remove the part “(Million Dollars”). And we rename it as “Region”. We can create one more column before column 1976 Jan, and copy paste the whole column B (Region) and choose the paste type as “Values”. After this, we can delete the column A (Variables) and Column B (Region). We need to repeat the above process for sheet “Export”. Then we can save this excel with the name “Import_Export”. \r\nAs long as we finish the preparation work, we can load Tableau to start the visualization work. To start with, we need to import the excel file. Then in the DataSource, we need to drag sheet “Export” to the panel. In the table part, we need to select all the year columns and right click to select the “Pivot”. \r\nNow we need to rename and change the data type of the columns. Rename “Pivot Field Names” as Date and change the data type as “Date”. Then rename “Pivot Field Values” as “Export Values” and change the data type as “Number (whole)”. \r\nJoin the “Import” table with “Export” table. Drag the “Import” table into the panel, and then repeat step 3 and 4 to pivot, rename, and change the data type of the “Import” table. To distinguish two tables, we need to name the columns as different column names. Here we name the date column as “Date2” and the value column as “Import Values”. So far, we need to define the relationship between “Export” and “Import” tables. Apart from the Region column from different tables which the system defined for us automatically, we need to add one more condition, which is to connect the two date of the tables. Now we finish all the pre-work for visualization. \r\n4.2 Visualization for area charts\r\nFilter year of 2019 and 2020. Drag the [Date] into filter, choose year in the filter filed, then click next. Select 2019 and 2020.\r\n\r\nFilter the [Region]. Here we take Mainland China as an example. Here we drag the [Region] into the filter, then tick the Mainland China and click ok. \r\nDrag [Export Values] and [Import Values] into Rows. \r\nIn the left-hand-side of the picture, drag the part of [Import Values] into [Export Values] to make it in the same y axis. Then we may find the columns and rows changed like the picture shown below.\r\n\r\nDrag the [Measure Names] from Columns to Color.\r\n\r\nGo to the Analysis and turn of the Stack Marks.\r\n\r\nTake [Date] into the Columns and set it as continuous by clicking the second Month in the drop-down list.\r\n\r\nTake the graph type as Area charts.\r\n\r\nSwap the colors of [Import Values] and [Export Values]. Then add the border color for the graph.\r\n\r\nDouble click the left-hand-side of the picture then edit the Axis. As we would like to make six maps with the same tick marks, we need to define the Fixed end as “8,000,000” and Tick Makrs interval as “1,000,000”.\r\n\r\nClick the title and name it as “Mainland China”, and set a proper position for the title to make the whole graph looks good.\r\n\r\nCreate graphs for other five regions. Right click the Mainland China sheet and click Duplicate to increase our work efficiency. Change the region name from the filter. Repeat this operation for several times until all the six regions graph are created.\r\n\r\n4.3 Visualization for horizontal bars\r\nDrag [Date] and [Region] into filter part. For [Date], we need to include 2019 and 2020. For [Region], we need to include all the six regions all together.\r\n\r\nDrag [Export Values] and [Region] into Columns and Rows respectively. \r\nDrag [Region] into Color and [Export Values] into Lable. Then Click “Sorted descending by sum of Export Values with Region”.\r\n\r\nSet the title name as “Export Data in 2019 and 2020”.\r\nRepeat the 1-4 process to get a sheet for import.\r\n\r\n4.4 Dashboard\r\nDrag all the sheet into the canvas and make all of them fit the entire view.\r\nAdjust the size and the position of each sheet.\r\nAdd the title name as “Merchandise Trade of Six Trading Regions, 2019-2020”.\r\nAdd source: Dashboard -> Object -> Drag Text at the bottom of the dashboard. Add “Source: Merchandize Trade by Region/Market, https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data”.\r\n5.0 Derived Insights\r\n\r\n1.Bar charts: In 2019 and 2020, Mainland China exported (141M million dollars) and imported (132.3M million dollars) around these six regions. Hong Kong exported in the second place in 2019-2020, but imported the least values compared with other regions and the value of Hong Kong exported was more than 14 times than imported. Malaysia ranked the second and third place while the United States ranked third and fourthe place in import and export respectively. Both the import and export of Japan is the fifth place with 48.7M and 51.4M million dollars respectively. Although Taiwan exported least with 47.4M, it imported 94.2M million dollars and ranked fourth in these six regions.\r\n2. Mainland China: the export experienced a constent decrease from Descember 2019 to Feburary 2020, then it increased gradually until August 2020. Similarly, in the August 2019 and August 2020, export merchandize trade in China decreased, then increased in October. The most marked decrease in import values appeared from November 2019 (6.389M million dollars) to February 2020 (3.979M million dollars). Both the import and export reached the lowest point in February 2020 affected by the combined effects of an extended Lunar New Year holiday and COVID-19 that disrupted the output and the supply chain. But after February 2020, both the export and import activity gradually returned to normal.\r\n3. Malaysia: the export had been through a sharp decline in the year of 2020. Compared with the same period of 2019, the total value of merchandise trade of all the months in 2020 decreased. Compared with the export trade, the import trade in Malaysia has not been affected much by covid-19 in 2020.\r\n4. United States: the export trade in US overally rised in 2020. It experienced three increase, January 2020 to April 2020, June 2020 to July 2020, August 2020 to December 2020 respectively. However, the import values decreased in 2020 except a slightly increase from February 2020 to March 2020, May 2020 to June 2020, and August 2020 to October 2020.\r\n5. Hong Kong: because Hong Kong is a free port and does not levy customs tariffs on import, impose tariff quotas or surcharges and there is no system of value added tax or equivalent, it becomes a trading hub. This means Hong Kong is an important gateway between China and the rest of the world. So it is not difficult to understand the export is much greater than the import in this region. Besides, the export of Hong Kong kept steadily increase from May 2020 to December 2020.\r\n6. Taiwan: unlike Hong Kong, Taiwan shows a different pattern between export and import. The import of Taiwan was two times more than its import. There is no significant change for import and export in 2019-2020 even the period of covid-19. Meanwhile, we can find a gradual increase in 2020.\r\n7. Japan: the difference of import and export is not significant in Japan. Both the import and export in 2019-2020 remained steadily in this country.\r\n6.0 Reference\r\nWhy not to use two axes, and what to use instead\r\nChina Jan.-Feb. imports and exports drop dragged by coronavirus disruption\r\nChoosing the right chart type: Line charts vs Area charts\r\nUnderstanding the Hong Kong customs and trade environment\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T23:05:55+08:00",
    "input_file": {}
  }
]
